FemDesign.ModellingTools.FictitiousShell._name
Identifier. Default FS.

FemDesign.ModellingTools.FictitiousShell._density
Density in t/m2

FemDesign.ModellingTools.FictitiousShell._t1
t1 in m

FemDesign.ModellingTools.FictitiousShell._t2
t2 in m

FemDesign.ModellingTools.FictitiousShell._alfa1
alfa_1 in 1/°C

FemDesign.ModellingTools.FictitiousShell._alfa2
alfa_2 in 1/°C

FemDesign.ModellingTools.FictitiousShell._meshSize
Avg. mesh size in m

FemDesign.ModellingTools.FictitiousShell.IgnoreInStImpCalculation
Ignore stiffness in stability and imperfection calculation

FemDesign.ModellingTools.FictitiousShell.#ctor
Parameterless constructor for serialization

FemDesign.ModellingTools.FictitiousShell.#ctor(FemDesign.Geometry.Region,FemDesign.ModellingTools.StiffnessMatrix4Type,FemDesign.ModellingTools.StiffnessMatrix4Type,FemDesign.ModellingTools.StiffnessMatrix2Type,System.Double,System.Double,System.Double,System.Double,System.Double,System.Boolean,System.Double,System.String)
Construct virtual shell
region:
membraneStiffness:
flexuralStiffness:
shearStiffness:
density:
t1:
t2:
alpha1:
alpha2:
ignoreInStImpCalc:
identifier:

FemDesign.ModellingTools.FictitiousShell.UpdateEdgeConnection(FemDesign.ModellingTools.FictitiousShell,FemDesign.Shells.EdgeConnection,System.Collections.Generic.List{System.Int32})
Set EdgeConnection by indices.
fictShell: Fictitious Shell
edgeConnection: EdgeConnection
indices: Index. List of items. Deconstruct fictitious shell to extract index for each respective edge.
Returns: